Revit 2023 API
Rebar.ReadOnlyParameters Property
 When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2018
Syntax
C#
public bool ReadOnlyParameters { get; set; }
Visual Basic
Public Property ReadOnlyParameters As Boolean
	Get
	Set
Visual C++
public:
property bool ReadOnlyParameters {
	bool get ();
	void set (bool value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  When setting this property: None of the following disciplines is enabled: Structural.
See Also
Rebar Class
Autodesk.Revit.DB.Structure Namespace